[
  {
    "ID": "AMG-GLE",
    "PNAME": "AMG GLE 53 4MATIC+ Coupe",
    "GNAME": "amg_gle53.jpg",
    "PRICE": 99900,
    "MSRP": 99900,
    "QTYONHAND": 7,
    "QTYONBO": 5,
    "DESCRIPTION": "AMG GLE 53 Coupe. The soul of a sports car, the skills of an SUV, and the elegance of a coupe unite to accelerate the pulse rate of Mercedes-AMG passion. Electrified torque whisks you ahead amid a range of driving wizardry.",
    "BRAND": "Mercedes"
  },
  {
    "ID": "AMG-E",
    "PNAME": "AMG E 53 4MATIC+ Coupe",
    "GNAME": "amg_e53.jpg",
    "PRICE": 95900,
    "MSRP": 95900,
    "QTYONHAND": 10,
    "QTYONBO": 6,
    "DESCRIPTION": "AMG E 53 4MATIC+ COUPE. There's no feeling quite like opening up an AMG coupe. The E 53 wraps the industry-advancing innovation of the E-Class with a powertain that brings classic muscle into the future.",
    "BRAND": "Mercedes"
  },
  {
    "ID": "AMG-G",
    "PNAME": "AMG G 63 SUV",
    "GNAME": "amg_g63.jpg",
    "PRICE": 211900,
    "MSRP": 211900,
    "QTYONHAND": 8,
    "QTYONBO": 3,
    "DESCRIPTION": "AMG G 63 SUV. Two renowned legacies of handcraftsmanship unite in the G 63: The globe-tested endurance of the G-Class, and the track-proven performance of AMG. The G 63 reasserts that timelessness can be delivered with a true sense of urgency.",
    "BRAND": "Mercedes"
  },
  {
    "ID": "AMG-C",
    "PNAME": "AMG C 43 4MATIC Cabriolet",
    "GNAME": "amg_c43.jpg",
    "PRICE": 91930,
    "MSRP": 77500,
    "QTYONHAND": 10,
    "QTYONBO": 4,
    "DESCRIPTION": "When you're born from the racing legacy of the AMG C-Class, driving wide-open is a way of life. The biturbo, four-seat C 43 Cabriolet features a power top that can turn a breeze into an invigorating rush.",
    "BRAND": "Mercedes"
  },
  {
    "ID": "AMG-CLA",
    "PNAME": "AMG CLA 45 4MATIC+ Coupe",
    "GNAME": "amg_cla45.jpg",
    "PRICE": 79290,
    "MSRP": 63900,
    "QTYONHAND": 13,
    "QTYONBO": 7,
    "DESCRIPTION": "The 382 handcrafted horsepower AMG CLA 45 is the most powerful car in its class, and arguably the most seductive as well.",
    "BRAND": "Mercedes"
  },
  {
    "ID": "BM-3",
    "PNAME": "BMW M3 Competition",
    "GNAME": "m3.jpg",
    "PRICE": 96404.7,
    "MSRP": 90900,
    "QTYONHAND": 12,
    "QTYONBO": 8,
    "DESCRIPTION": "The BMW M3 vehicles combine powerful proportions and distinctive four-door 3-box design with the sportiness typical of M. Leading these bold characters is the BMW M3 Competition Sedan with its impressive 510 hp and 479 ft/lb of torque. Equipped with a high-performance BMW M TwinPower Turbo power unit, 8-speed M Steptronic with Drivelogic, optional all-wheel drive M xDrive, Active M Differential and numerous technologies derived from motorsport, it guarantees maximum driving dynamics – both in everyday use and on the race track.",
    "BRAND": "BMW"
  },
  {
    "ID": "BM-4",
    "PNAME": "BMW M4 CSL",
    "GNAME": "m4.jpg",
    "PRICE": 169754.7,
    "MSRP": 166500,
    "QTYONHAND": 8,
    "QTYONBO": 2,
    "DESCRIPTION": "In the new BMW M4 CSL everything is designed with a view to enabling the experience of uncompromising motorsport DNA in everyday use.",
    "BRAND": "BMW"
  },
  {
    "ID": "BM-5",
    "PNAME": "BMW M5 Competition",
    "GNAME": "m5.jpg",
    "PRICE": 145054.7,
    "MSRP": 125700,
    "QTYONHAND": 9,
    "QTYONBO": 3,
    "DESCRIPTION": "The athletic BMW 5 Series Sedan delivers 523 hp and impresses with an especially balanced combination of sportiness, comfort and efficiency.",
    "BRAND": "BMW"
  },
  {
    "ID": "BM-8",
    "PNAME": "BMW M8 Competition Cabriolet",
    "GNAME": "m8.jpg",
    "PRICE": 179804.7,
    "MSRP": 167600,
    "QTYONHAND": 11,
    "QTYONBO": 5,
    "DESCRIPTION": "THE NEW BMW M8 Competition Cabriolet. Experience sporty driving pleasure at the highest level – with the impressively powerful the new BMW 8 Series Cabriolet M Automobiles: The new BMW M8 Competition Cabriolet combines pure M genes with supreme exclusivity – for driving adventures full of sporting flair and luxury. The new BMW M850i xDrive Cabriolet impresses with a unique synthesis of comfort, performance and efficiency.",
    "BRAND": "BMW"
  },
  {
    "ID": "BM-X6",
    "PNAME": "BMW X6 M Competition",
    "GNAME": "x6m.jpg",
    "PRICE": 146154.7,
    "MSRP": 137000,
    "QTYONHAND": 9,
    "QTYONBO": 3,
    "DESCRIPTION": "The BMW X6 M Automobiles demonstrate their extroverted dominance with outstanding driving dynamics, expressive M design and unrivalled agility. The BMW X6 M Competition with M xDrive inspires with a luxurious interior and driving dynamics defined by motor racing genes. ",
    "BRAND": "BMW"
  },
  {
    "ID": "T-S",
    "PNAME": "Model S",
    "GNAME": "model_s.jpg",
    "PRICE": 137490,
    "MSRP": 129590,
    "QTYONHAND": 10,
    "QTYONBO": 7,
    "DESCRIPTION": "Model S Plaid has the quickest acceleration of any vehicle in production. Updated battery architecture for all Model S trims enables back-to-back track runs without performance degradation.",
    "BRAND": "Tesla"
  },
  {
    "ID": "T-3",
    "PNAME": "Model 3",
    "GNAME": "model_3.jpg",
    "PRICE": 61980,
    "MSRP": 65280,
    "QTYONHAND": 12,
    "QTYONBO": 5,
    "DESCRIPTION": "Model 3 comes with the option of dual motor all-wheel drive, 20” Überturbine Wheels and Performance Brakes for total control in all weather conditions. A carbon fiber spoiler improves stability at high speeds, all allowing Model 3 to accelerate from 0-100 km/h* in as little as 3.3 seconds.",
    "BRAND": "Tesla"
  },
  {
    "ID": "T-X",
    "PNAME": "Model X",
    "GNAME": "model_x.jpg",
    "PRICE": 156790,
    "MSRP": 147590,
    "QTYONHAND": 7,
    "QTYONBO": 3,
    "DESCRIPTION": "With the most power and quickest acceleration of any SUV, Model X Plaid is the highest performing SUV ever built. All Model X powertrains, with updated battery architecture, can deliver instant torque at any speed.",
    "BRAND": "Tesla"
  },
  {
    "ID": "T-Y",
    "PNAME": "Model Y Performance",
    "GNAME": "model_y.jpg",
    "PRICE": 90390,
    "MSRP": 90390,
    "QTYONHAND": 15,
    "QTYONBO": 10,
    "DESCRIPTION": "Tesla All-Wheel Drive has two ultra-responsive, independent electric motors that digitally control torque to the front and rear wheels—for far better handling, traction and stability control. Model Y is capable in rain, snow, mud and off-road.",
    "BRAND": "Tesla"
  },
  {
    "ID": "T-CT",
    "PNAME": "Cybertruck",
    "GNAME": "cybertruck.jpg",
    "PRICE": 54000,
    "MSRP": 53000,
    "QTYONHAND": 6,
    "QTYONBO": 2,
    "DESCRIPTION": "Cybertruck is built with an exterior shell made for ultimate durability and passenger protection. Starting with a nearly impenetrable exoskeleton, every component is designed for superior strength and endurance, from Ultra-Hard 30X Cold-Rolled stainless-steel structural skin to Tesla armor glass.",
    "BRAND": "Tesla"
  }
]
